# Insert Rows into a Table

In [1]:
from DATA225utils import make_connection
from employee import reset_employee, print_employee

In [2]:
conn = make_connection(config_file = 'personnel.ini')
cursor = conn.cursor()

reset_employee(conn)

### Insert one row at a time

In [3]:
sql = ( """
        INSERT INTO employee
        VALUES (123, 'Jones', 'Mary', 150000.00)
        """
      )
       
cursor.execute(sql)
conn.commit()

### SQL syntax does not allow `_` in numbers.

### Insert multiple rows

In [4]:
sql = ( """
        INSERT INTO employee
        VALUES (456, 'Smith',  'George', 100000.00),
               (789, 'Brown',  'Leslie', 125000.00),
               (941, 'Wilson', 'Sidney', 250000.00)
        """
      ) 

cursor.execute(sql)
conn.commit()

#### An insertion requires a `conn.commit()` or it doesnâ€™t actually happen.

### Insert specific columns

In [5]:
sql = ( """
        INSERT INTO employee (last, first, id)
        VALUES ('Schmidt', 'Frank', 604)
        """
      )
    
cursor.execute(sql)
conn.commit()

In [6]:
print_employee(conn)

5 rows:

    id     last   first    salary
0  123    Jones    Mary  150000.0
1  456    Smith  George  100000.0
2  604  Schmidt   Frank       NaN
3  789    Brown  Leslie  125000.0
4  941   Wilson  Sidney  250000.0

In [7]:
cursor.close()
conn.close()

In [ ]:
# Copyright (c) 2023 by Ronald Mak